pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
/*
 * LoRaWAN Single Channel Gateway for ChirpStack
 * Hardware: Heltec WiFi LoRa 32 V4 (ESP32-S3 + SX1262)
 * 
 * Features:
 * - RadioLib for SX1262 support
 * - Semtech UDP protocol for ChirpStack
 * - OLED display
 * - WiFi connectivity
 * - NTP time synchronization
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <SPI.h>
#include <Wire.h>
#include <RadioLib.h>
#include <ArduinoJson.h>
#include <time.h>
#include <ArduinoOTA.h>
#include "USBCDC.h"
#include "config.h"
#include "esp32-hal.h"
#include "variant.h"
#include "common.h"
#include "TypeDef.h"
#include "power.h"

// ===========================
// OLED DISPLAY
// ===========================
#if DISPLAY_ENABLED
#include <U8g2lib.h>
// SSD1306/SSD1315 128x64 I2C display (Heltec V4 uses SSD1306)
// Hardware I2C: pins are set with Wire.begin(), only reset is needed
U8G2_SSD1306_128X64_NONAME_F_HW_I2C display(U8G2_R0, /* reset=*/ RESET_OLED);
#endif

// ===========================
// RADIO CONFIGURATION
// ===========================
SPIClass loraSPI(HSPI);
SX1262 radio = new Module(LORA_CS, LORA_DIO1, LORA_RESET, LORA_DIO2, loraSPI);

#if defined(LORA_PA_EN)
// RadioLib commuta questi pin da solo a ogni passaggio TX/RX.
static const uint32_t rfswitch_pins[] = {LORA_PA_EN, LORA_PA_TX_EN, RADIOLIB_NC, RADIOLIB_NC, RADIOLIB_NC};
static const Module::RfSwitchMode_t rfswitch_table[] = {
    {Module::MODE_IDLE, {LOW, LOW}},
    {Module::MODE_RX, {HIGH, LOW}},
    {Module::MODE_TX, {HIGH, HIGH}},
    END_OF_MODE_TABLE,
};
#endif

// ===========================
// NETWORK CONFIGURATION
// ===========================
WiFiUDP udpClient;
IPAddress serverIP;

const char* version = "1.0.0";

// ===========================
// GATEWAY STATE
// ===========================
uint64_t gatewayId = 0;
uint32_t packetsReceived = 0;
uint32_t packetsForwarded = 0;
unsigned long lastDisplayUpdate = 0;
unsigned long lastNtpUpdate = 0;
unsigned long lastPullData = 0;
unsigned long lastPowerCheck = 0;
unsigned long powerCheckInterval = 120000;
bool radioInitialized = false;

// Stato connessione al network server (ChirpStack), verificato tramite PULL_ACK
unsigned long lastPullAck = 0;
const unsigned long CS_LINK_TIMEOUT = 15000; // nessun ACK da 15s -> considerato offline (3x intervallo PULL_DATA)
bool isCsOnline() {
    return lastPullAck != 0 && (millis() - lastPullAck < CS_LINK_TIMEOUT);
}

// SERVER_HOST si risolve di nuovo dal loop, non solo all'avvio: il gateway e'
// alimentato dal Pi e riparte con lui, ma e' pronto ben prima che l'mDNS del Pi
// risponda, quindi la risoluzione in setup() fallisce e serverIP restava
// 0.0.0.0 per sempre (PULL_DATA in broadcast, gateway offline in ChirpStack).
// Serve anche se l'IP del server cambia (il Pi pubblica sia .100 che .110).
const unsigned long RESOLVE_RETRY_INTERVAL = 10000;  // senza indirizzo: riprova ogni 10s
const unsigned long RESOLVE_STALE_TIMEOUT = 60000;   // nessun PULL_ACK da 60s: risolve di nuovo
unsigned long lastResolveAttempt = 0;

bool hasServerIP() {
    return serverIP != IPAddress((uint32_t)0);
}


// Interrupt flag for packet reception
volatile bool packetReceived = false;

// Flag per ignorare la ricezione subito dopo downlink
bool justTransmitted = false;

// Debug counters
uint32_t totalInterrupts = 0;
uint32_t crcErrors = 0;
uint32_t timeouts = 0;
uint32_t otherErrors = 0;

// ===========================
// INTERRUPT SERVICE ROUTINE
// ===========================
// Cattura il timestamp qui, non più avanti in handleLoRaPacket(): quello è il
// vero istante (a livello hardware) in cui il pacchetto è arrivato. Catturarlo
// dopo, nel loop principale, dopo Serial.print/printf e una transazione SPI
// (radio.readData()), introduce un ritardo sistematico che si somma su ogni
// pacchetto - piccolo in assoluto, ma sufficiente a far mancare consistentemente
// la finestra RX1/RX2 della Join Accept quando il margine è di poche decine di ms.
volatile unsigned long lastRxTimestamp = 0;

void IRAM_ATTR setPacketReceivedFlag() {
    lastRxTimestamp = millis();
    packetReceived = true;
}

// ===========================
// STATISTICS
// ===========================
struct Statistics {
    uint32_t rx_received;
    uint32_t rx_ok;
    uint32_t rx_fw;
    uint32_t rx_bad;
    uint32_t tx_received;
    uint32_t tx_emitted;
} stats = {0};

// ===========================
// FUNCTION DECLARATIONS
// ===========================
void initDisplay();
void updateDisplay();
void initWiFi();
bool resolveServer();
void maintainServerIP();
void initOTA();
void initLoRa();
void initNTP();
void sendUdpPacket(const char* jsonData);
void handleLoRaPacket();
void sendStatPacket();
void sendPullData();
void handleUdpDownlink();
void sendDownlinkResponse(unsigned long rxTimestamp, PullRespPacket *pullRespPacket);
// txError (opzionale): su fallimento riceve il valore TxAckStatus da mettere
// nel TX_ACK ("TOO_LATE" se le finestre sono scadute, "INTERNAL_ERROR" se e'
// la radio ad aver fallito). Resta nullptr in caso di successo.
bool transmitDownlink(uint8_t* data, size_t length, unsigned long rxTimestamp,
                      const char** txError = nullptr);
// error (opzionale): se non nullptr aggiunge il JSON {"txpk_ack":{"error":...}}.
// DEVE essere un membro dell'enum TxAckStatus di ChirpStack, altrimenti il
// gateway-bridge scarta l'intero TX_ACK ("unexpected error: ...").
void sendTxAck(uint16_t token, const char* error = nullptr);
void decodeLoRaWANPacket(uint8_t *data, size_t length);



DownlinkQueue dowQueue = DownlinkQueue();

// ===========================
// SETUP
// ===========================
void setup() {

  analogInit();
    // Initialize USB Serial
    Serial.begin(115200);
    
    // Wait for USB CDC connection (max 3 seconds)
    for(int i=0; i<30 && !Serial; i++) {
        delay(100);
    }
    
    Serial.println("\n\n===================================");
    Serial.println("LoRaWAN Gateway for ChirpStack");
    Serial.println("Hardware: Heltec WiFi LoRa 32 V4");
    Serial.println("Version: " + String(version));
    Serial.println("===================================\n");

    // Initialize LED
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);  // LED on
    
    // Initialize OLED display
    #if DISPLAY_ENABLED
    initDisplay();
    #endif
    
    // Initialize WiFi
    initWiFi();
    
