pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    // Initialize OTA
    initOTA();
    
    // Initialize NTP
    initNTP();
    
    // Generate Gateway ID from MAC
    generateGatewayId(&gatewayId);
    
    // Initialize LoRa radio
    initLoRa();
    
    digitalWrite(LED_PIN, HIGH);  // LED off
    
    Serial.println("\n===================================");
    Serial.println("Gateway ready!");
    Serial.println("===================================\n");
}

void processDownlinkQueue() {
  PullRespPacket *pullRespPacket = dowQueue.findFirstImmediate();
  if (pullRespPacket) {
    // txpk.data is the *base64 text string* from the PULL_RESP JSON, never
    // decoded - transmitting it directly (as this did before) sends the raw
    // ASCII bytes of that string over the air instead of the actual binary
    // LoRaWAN frame. decodedPayload/decodedLength (already base64-decoded by
    // getPullResponse(), same as what the RX1/RX2 path in transmitDownlink()
    // uses) is the correct buffer.
    radio.invertIQ(true);
    int state = radio.transmit(pullRespPacket->responseData.decodedPayload, pullRespPacket->responseData.decodedLength);
    radio.invertIQ(false);
    digitalWrite(LED_PIN, HIGH);
    justTransmitted = true;

    if (state == RADIOLIB_ERR_NONE) {
      Serial.println("[PULL] ✅ Messaggio Classe C trasmesso con successo!");
      sendTxAck(pullRespPacket->token);
      dowQueue.remove(pullRespPacket);
      stats.tx_emitted++;
    } else {
      Serial.printf("[PULL] ❌ Errore trasmissione messaggio Classe C: %d\n", state);
      sendTxAck(pullRespPacket->token, "INTERNAL_ERROR");

      // Rimuovere sempre: processDownlinkQueue() gira ad ogni iterazione del
      // loop e radio.transmit() e' bloccante, quindi un elemento lasciato in
      // coda verrebbe ritentato all'infinito bloccando RX LoRa, UDP e stat.
      dowQueue.remove(pullRespPacket);
    }
  }
}

void powerCheck() {
    uint16_t batteryVoltage = analogLevel.getBattVoltage();
    Serial.printf("[POWER] Battery voltage: %d\n", batteryVoltage);
    int batteryPercent = analogLevel.getBatteryPercent();
    Serial.printf("[POWER] Battery percent: %d\n", batteryPercent);
    bool isBatteryConnected = analogLevel.isBatteryConnect();
    Serial.printf("[POWER] Battery connected: %s\n", isBatteryConnected ? "YES" : "NO");
    bool isVbusIn = analogLevel.isVbusIn();
    Serial.printf("[POWER] Vbus in: %s\n", isVbusIn ? "YES" : "NO");
    bool isCharging = analogLevel.isCharging();
    Serial.printf("[POWER] Charging: %s\n", isCharging ? "YES" : "NO");
}
// ===========================
// MAIN LOOP
// ===========================
void loop() {
    // Handle OTA updates
    ArduinoOTA.handle();

    // Check power status periodically
    if (millis() - lastPowerCheck > powerCheckInterval) {
        powerCheck();
        lastPowerCheck = millis();
    }
    maintainServerIP();

    // Send PULL_DATA to ChirpStack periodically (every 5 seconds)
    if (millis() - lastPullData > 5000) {
        sendPullData();
        lastPullData = millis();
    }
    
    // Check for UDP packets from ChirpStack (downlink)
    handleUdpDownlink();
    processDownlinkQueue();
    
    // Handle incoming LoRa packets only when interrupt flag is set
    if (radioInitialized && packetReceived) {
        handleLoRaPacket();
    }
    
    // Update display periodically
    #if DISPLAY_ENABLED
    if (millis() - lastDisplayUpdate > DISPLAY_UPDATE_INTERVAL) {
        updateDisplay();
        lastDisplayUpdate = millis();
    }
    #endif
    
    // Update NTP periodically
    if (millis() - lastNtpUpdate > NTP_UPDATE_INTERVAL) {
        initNTP();
        lastNtpUpdate = millis();
    }
    
    // Send statistics (vedi STAT_INTERVAL in config.h: deve combaciare con lo
    // "Stats interval" del gateway in ChirpStack, che da' per offline dopo 2x)
    static unsigned long lastStatTime = 0;
    if (lastStatTime == 0 || millis() - lastStatTime > STAT_INTERVAL) {
        sendStatPacket();
        lastStatTime = millis();
    }
    
    // Debug: stampa statistiche ogni 10 secondi
    static unsigned long lastDebugTime = 0;
    if (millis() - lastDebugTime > 120000) {
        Serial.println("\n[STATS] ===== GATEWAY STATUS =====");
        Serial.printf("[STATS] Uptime: %lu s\n", millis() / 1000);
        Serial.printf("[STATS] Interrupt totali: %lu\n", totalInterrupts);
        Serial.printf("[STATS] Pacchetti OK: %lu\n", stats.rx_ok);
        Serial.printf("[STATS] Errori CRC: %lu\n", crcErrors);
        Serial.printf("[STATS] Timeout: %lu\n", timeouts);
        Serial.printf("[STATS] Altri errori: %lu\n", otherErrors);
        Serial.printf("[STATS] Radio in ascolto: %s\n", radioInitialized ? "SI" : "NO");
        Serial.printf("[STATS] WiFi: %s\n", WiFi.isConnected() ? "OK" : "DISCONNESSO");
        Serial.println("[STATS] ===============================\n");
        lastDebugTime = millis();
    }
    
    // Small delay to prevent watchdog issues
    delay(1);
}

// ===========================
// DISPLAY FUNCTIONS
// ===========================
void initDisplay() {
    #if DISPLAY_ENABLED
    // Enable power to OLED display (active LOW)
    pinMode(VEXT_ENABLE, OUTPUT);
    digitalWrite(VEXT_ENABLE, LOW);
    delay(100); // Give the display time to power up
    
    // Initialize I2C for display
    Wire.begin(I2C_SDA, I2C_SCL);
    
    display.begin();
    display.clearBuffer();
    display.setFont(u8g2_font_6x10_tr);
    display.drawStr(0, 10, "LoRaWAN Gateway");
    display.drawStr(0, 25, "Initializing...");
    display.sendBuffer();
    
    Serial.println("[DISPLAY] Initialized");
    #endif
}

void updateDisplay() {
    #if DISPLAY_ENABLED
    display.clearBuffer();
    display.setFont(u8g2_font_6x10_tr);
    
    // Title
    display.drawStr(0, 10, "LoRaWAN Gateway");
    
    // WiFi status
    char line[32];
    snprintf(line, sizeof(line), "WiFi:%s CS:%s", WiFi.isConnected() ? "OK" : "NO", isCsOnline() ? "OK" : "NO");
    display.drawStr(0, 22, line);

    // Frequency and SF
    snprintf(line, sizeof(line), "%.1fMHz SF%d", LORA_FREQUENCY, LORA_SPREADING_FACTOR);
    display.drawStr(0, 34, line);
    
