pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    // Statistics
    snprintf(line, sizeof(line), "RX: %lu FW: %lu", stats.rx_ok, stats.rx_fw);
    display.drawStr(0, 46, line);
    
    // Time
    time_t now = time(nullptr);
    struct tm* timeinfo = localtime(&now);
    snprintf(line, sizeof(line), "%02d:%02d:%02d", 
             timeinfo->tm_hour, timeinfo->tm_min, timeinfo->tm_sec);
    display.drawStr(0, 58, line);
    
    display.sendBuffer();
    #endif
}

// ===========================
// WIFI FUNCTIONS
// ===========================
void initWiFi() {
    Serial.print("[WIFI] Connecting to ");
    Serial.print(WIFI_SSID);
    Serial.print("...");
    
    #if DISPLAY_ENABLED
    display.clearBuffer();
    display.drawStr(0, 10, "WiFi connecting...");
    display.sendBuffer();
    #endif
    
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    
    unsigned long startTime = millis();
    while (WiFi.status() != WL_CONNECTED) {
        if (millis() - startTime > WIFI_CONNECT_TIMEOUT) {
            Serial.println("\n[WIFI] Connection timeout!");
            #if DISPLAY_ENABLED
            display.clearBuffer();
            display.drawStr(0, 10, "WiFi FAILED!");
            display.sendBuffer();
            #endif
            delay(5000);
            ESP.restart();
        }
        delay(500);
        Serial.print(".");
    }
    
    Serial.println(" Connected!");
    Serial.print("[WIFI] IP address: ");
    Serial.println(WiFi.localIP());
    Serial.print("[WIFI] MAC address: ");
    Serial.println(WiFi.macAddress());
    
    // Se fallisce (tipico: il Pi sta ancora avviandosi) ci riprova maintainServerIP()
    resolveServer();
}

// Risolve SERVER_HOST in un IP temporaneo: se fallisce, serverIP resta com'era
// invece di finire a 0.0.0.0
bool resolveServer() {
    lastResolveAttempt = millis();
    IPAddress resolved;
    if (WiFi.hostByName(SERVER_HOST, resolved) && resolved != IPAddress((uint32_t)0)) {
        if (resolved != serverIP) {
            Serial.print("[SERVER] Resolved to: ");
            Serial.println(resolved);
        }
        serverIP = resolved;
        return true;
    }
    Serial.printf("[SERVER] ERROR: Could not resolve %s (keeping %s)\n",
                  SERVER_HOST, serverIP.toString().c_str());
    return false;
}

void maintainServerIP() {
    if (!WiFi.isConnected()) return;
    unsigned long sinceAttempt = millis() - lastResolveAttempt;
    if (!hasServerIP()) {
        if (sinceAttempt > RESOLVE_RETRY_INTERVAL) resolveServer();
        return;
    }
    // Indirizzo presente ma ChirpStack muto: magari e' cambiato l'IP del Pi
    unsigned long sinceAck = millis() - lastPullAck;
    if (sinceAck > RESOLVE_STALE_TIMEOUT && sinceAttempt > RESOLVE_STALE_TIMEOUT) {
        Serial.println("[SERVER] No PULL_ACK for 60s, re-resolving server");
        resolveServer();
    }
}

// ===========================
// OTA FUNCTIONS
// ===========================
void initOTA() {
    Serial.println("[OTA] Initializing OTA...");
    
    // Imposta hostname per mDNS
    ArduinoOTA.setHostname(OTA_HOSTNAME);
    
    // Imposta password (opzionale ma consigliata)
    ArduinoOTA.setPassword(OTA_PASSWORD);
    
    // Callback quando inizia l'aggiornamento
    ArduinoOTA.onStart([]() {
        String type;
        if (ArduinoOTA.getCommand() == U_FLASH) {
            type = "sketch";
        } else {  // U_SPIFFS
            type = "filesystem";
        }
        
        Serial.println("[OTA] Start updating " + type);
        
        #if DISPLAY_ENABLED
        display.clearBuffer();
        display.drawStr(0, 10, "OTA Update...");
        display.drawStr(0, 25, type.c_str());
        display.sendBuffer();
        #endif
        
        // Ferma la radio durante l'aggiornamento
        if (radioInitialized) {
            radio.standby();
        }
    });
    
    // Callback durante l'aggiornamento (progresso)
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        unsigned int percent = (progress * 100) / total;
        Serial.printf("[OTA] Progress: %u%%\r", percent);
        
        #if DISPLAY_ENABLED
        if (percent % 10 == 0) {  // Aggiorna display ogni 10%
            display.clearBuffer();
            display.drawStr(0, 10, "OTA Update...");
            char progressStr[32];
            snprintf(progressStr, sizeof(progressStr), "Progress: %u%%", percent);
            display.drawStr(0, 25, progressStr);
            display.sendBuffer();
        }
        #endif
    });
    
    // Callback quando l'aggiornamento è completato
    ArduinoOTA.onEnd([]() {
        Serial.println("\n[OTA] Update complete!");
        
        #if DISPLAY_ENABLED
        display.clearBuffer();
        display.drawStr(0, 10, "OTA Complete!");
        display.drawStr(0, 25, "Rebooting...");
        display.sendBuffer();
        #endif
        
        delay(1000);
    });
    
    // Callback in caso di errore
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf("[OTA] Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR) {
            Serial.println("Auth Failed");
        } else if (error == OTA_BEGIN_ERROR) {
            Serial.println("Begin Failed");
        } else if (error == OTA_CONNECT_ERROR) {
            Serial.println("Connect Failed");
        } else if (error == OTA_RECEIVE_ERROR) {
            Serial.println("Receive Failed");
        } else if (error == OTA_END_ERROR) {
            Serial.println("End Failed");
        }
        
        #if DISPLAY_ENABLED
        display.clearBuffer();
        display.drawStr(0, 10, "OTA ERROR!");
        display.sendBuffer();
        #endif
        
        // Riavvia la radio
        if (radioInitialized) {
            radio.startReceive();
        }
    });
    
    ArduinoOTA.begin();
    
    Serial.println("[OTA] Ready!");
    Serial.println("[OTA] Hostname: esp32-gateway.local");
    Serial.print("[OTA] IP address: ");
    Serial.println(WiFi.localIP());
}

// ===========================
// NTP FUNCTIONS
// ===========================
void initNTP() {
    Serial.print("[NTP] Synchronizing time...");
    
