pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    configTime(0, 0, NTP_SERVER);
    
    time_t now = time(nullptr);
    int retry = 0;
    while (now < 8 * 3600 * 2 && retry < 15) {
        delay(500);
        Serial.print(".");
        now = time(nullptr);
        retry++;
    }
    
    if (now > 8 * 3600 * 2) {
        Serial.println(" OK");
        struct tm timeinfo;
        gmtime_r(&now, &timeinfo);
        Serial.print("[NTP] Current time: ");
        Serial.println(asctime(&timeinfo));
    } else {
        Serial.println(" FAILED");
    }
    
    lastNtpUpdate = millis();
}


// ===========================
// LORA INITIALIZATION
// ===========================
void initLoRa() {
    Serial.println("[LORA] Initializing SX1262...");
    
    #if DISPLAY_ENABLED
    display.clearBuffer();
    display.drawStr(0, 10, "LoRa init...");
    display.sendBuffer();
    #endif
    
    // Initialize SPI for LoRa

#if defined(LORA_PA_POWER)
    pinMode(LORA_PA_POWER, OUTPUT);
    digitalWrite(LORA_PA_POWER, HIGH);
    Serial.printf("[LORA] PA esterno alimentato (pin %d)\n", LORA_PA_POWER);
    radio.setRfSwitchTable(rfswitch_pins, rfswitch_table);
    Serial.println("[LORA] setRfSwitchTable (GC1109) configurata");
#endif

    loraSPI.begin(LORA_SCK, LORA_MISO, LORA_MOSI, LORA_CS);
    
    // Initialize radio
    // L'ottavo argomento e' la tensione del TCXO, ed e' il motivo per cui va
    // passato esplicitamente: il default di RadioLib e' 1.6 V, ma il TCXO
    // delle Heltec (alimentato dal DIO3 della radio) vuole 1.8 V - come gia'
    // dichiarava variant.h con SX126X_DIO3_TCXO_VOLTAGE, define che pero'
    // nessuno leggeva. Sottoalimentato, il TCXO oscilla fuori specifica e
    // l'errore di frequenza che ne deriva si paga tutto in sensibilita'.
    int state = radio.begin(LORA_FREQUENCY, 
                           LORA_BANDWIDTH, 
                           LORA_SPREADING_FACTOR, 
                           LORA_CODING_RATE, 
                           LORA_SYNC_WORD, 
                           LORA_OUTPUT_POWER, 
                           LORA_PREAMBLE_LENGTH,
                           SX126X_DIO3_TCXO_VOLTAGE);
    
    if (state == RADIOLIB_ERR_NONE) {
        Serial.println("[LORA] SX1262 initialized successfully!");
        Serial.printf("[LORA] Frequency: %.1f MHz\n", LORA_FREQUENCY);
        Serial.printf("[LORA] Bandwidth: %.1f kHz\n", LORA_BANDWIDTH);
        Serial.printf("[LORA] Spreading Factor: %d\n", LORA_SPREADING_FACTOR);
        Serial.printf("[LORA] Coding Rate: 4/%d\n", LORA_CODING_RATE);
        Serial.printf("[LORA] Output Power: %d dBm\n", LORA_OUTPUT_POWER);
        
        radioInitialized = true;
    } else {
        Serial.print("[LORA] ERROR: Initialization failed, code: ");
        Serial.println(state);
        
        #if DISPLAY_ENABLED
        display.clearBuffer();
        display.drawStr(0, 10, "LoRa FAILED!");
        char errorStr[32];
        snprintf(errorStr, sizeof(errorStr), "Error: %d", state);
        display.drawStr(0, 22, errorStr);
        display.sendBuffer();
        #endif
        
        return;
    }
    
    // Configure DIO2 as RF switch for Heltec V4
    state = radio.setDio2AsRfSwitch(true);
    if (state != RADIOLIB_ERR_NONE) {
        Serial.print("[LORA] WARNING: setDio2AsRfSwitch failed, code: ");
        Serial.println(state);
    }
    
    // Set CRC
    state = radio.setCRC(LORA_CRC);
    if (state != RADIOLIB_ERR_NONE) {
        Serial.print("[LORA] WARNING: setCRC failed, code: ");
        Serial.println(state);
    } else {
        Serial.printf("[LORA] CRC: %s\n", LORA_CRC ? "ABILITATO" : "DISABILITATO");
    }
    
    // Set interrupt action on DIO1
    radio.setDio1Action(setPacketReceivedFlag);
    Serial.println("[LORA] Interrupt configured on DIO1");
    
    const float currentLimit = 140.0f;
    state = radio.setCurrentLimit(currentLimit);
    Serial.printf("[RadioLib] Current limit set to %.1f mA\n", currentLimit);
    Serial.printf("[RadioLib] Current limit set result %d\n", state);

    // Guadagno maggiorato in ricezione: qualche mA in piu' per 2-3 dB di
    // sensibilita'. Su un gateway, che sta sempre in ascolto, e' il posto dove
    // rendono di piu'.
    state = radio.setRxBoostedGainMode(true);
    Serial.printf("[RadioLib] RX boosted gain -> %d\n", state);
    
    // Riepilogo configurazione
    Serial.println("\n[LORA] ===== CONFIGURAZIONE RADIO =====");
    Serial.printf("[LORA] Frequenza: %.3f MHz\n", LORA_FREQUENCY);
    Serial.printf("[LORA] Bandwidth: %.1f kHz\n", LORA_BANDWIDTH);
    Serial.printf("[LORA] Spreading Factor: %d\n", LORA_SPREADING_FACTOR);
    Serial.printf("[LORA] Coding Rate: 4/%d\n", LORA_CODING_RATE);
    Serial.printf("[LORA] Sync Word: 0x%02X\n", LORA_SYNC_WORD);
    Serial.printf("[LORA] Preamble Length: %d\n", LORA_PREAMBLE_LENGTH);
    Serial.printf("[LORA] Output Power: %d dBm\n", LORA_OUTPUT_POWER);
    Serial.printf("[LORA] CRC: %s\n", LORA_CRC ? "SI" : "NO");
    Serial.println("[LORA] ====================================\n");
    
    // Start receiving
    state = radio.startReceive();
    if (state == RADIOLIB_ERR_NONE) {
        Serial.println("[LORA] ✅ Started receiving - In ascolto per pacchetti...\n");
    } else {
        Serial.print("[LORA] ❌ ERROR: startReceive failed, code: ");
        Serial.println(state);
        radioInitialized = false;
    }
}

// ===========================
// LORA PACKET HANDLING
// ===========================
void handleLoRaPacket() {
    Serial.println("\n[RX] ===== HANDLING LORA PACKET =====");
    uint8_t rxBuffer[256];
    
    // Conta interrupt totali
    totalInterrupts++;
    
    // Reset interrupt flag
    packetReceived = false;
    
    // Se abbiamo appena trasmesso, ignora questo pacchetto (potrebbe essere il nostro eco)
    if (justTransmitted) {
        Serial.println("[DEBUG] Ignorato pacchetto subito dopo trasmissione (eco)");
        justTransmitted = false;
        radio.startReceive();
        return;
    }
    
    Serial.printf("[DEBUG] Interrupt #%lu - Lettura dati radio...\n", totalInterrupts);
    
    // Check if packet available
    int state = radio.readData(rxBuffer, sizeof(rxBuffer));
    
    
    if (state == RADIOLIB_ERR_NONE) {
        // Packet received successfully
        // Preso in setPacketReceivedFlag() (ISR), non qui: a questo punto sono
        // già passati due Serial.print/printf e la SPI read sopra, che
        // introducono un ritardo sistematico rispetto al vero istante di
        // arrivo del pacchetto via radio.
        unsigned long rxTimestamp = lastRxTimestamp;
        
        digitalWrite(LED_PIN, LOW);  // LED on
        
        size_t packetLength = radio.getPacketLength();
        float rssi = radio.getRSSI();
        float snr = radio.getSNR();
        
        stats.rx_received++;
        stats.rx_ok++;
        
        Serial.println("\n[RX] ---------------- LORA PACKET RECEIVED ----------------");
        Serial.printf("[RX] Length: %d bytes\n", packetLength);
        Serial.printf("[RX] RSSI: %.2f dBm\n", rssi);
        Serial.printf("[RX] SNR: %.2f dB\n", snr);
        Serial.print("[RX] Data (HEX): ");
        for (size_t i = 0; i < packetLength; i++) {
            Serial.printf("%02X ", rxBuffer[i]);
        }
        Serial.println();
        Serial.print("[RX] Data (ASCII): ");
        for (size_t i = 0; i < packetLength; i++) {
            if (rxBuffer[i] >= 32 && rxBuffer[i] <= 126) {
                Serial.printf("%c", rxBuffer[i]);
            } else {
                Serial.print(".");
            }
        }
        Serial.println();
        
