pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
        PullRespPacket *pullRespPacket = nullptr;
        LoRaWANHeader lorawanHeader;
        memcpy(&lorawanHeader, rxBuffer, sizeof(LoRaWANHeader));

        // Per una Join Request (MType 0) lorawanHeader.devAddr non è un campo
        // valido: a quella posizione nel frame c'è il JoinEUI, non un vero
        // DevAddr - va tenuto a mente ovunque più sotto si ragiona su devAddr
        // per questo uplink (ricerca in coda, controllo di sanità pre-invio).
        uint8_t uplinkMType = (lorawanHeader.mhdr >> 5) & 0x07;
        bool isJoinRequest = (uplinkMType == 0x00);

        Serial.printf("[RX] MHDR: 0x%02X\n", lorawanHeader.mhdr);

        if (isJoinRequest && packetLength >= 23) {
            // Join Request: MHDR(1) | JoinEUI(8, LE) | DevEUI(8, LE) | DevNonce(2, LE) | MIC(4)
            // DevAddr/FCtrl/FCnt non esistono in questo frame - non stamparli,
            // sono fuorvianti (lorawanHeader li legge comunque, ma da byte che
            // qui sono in realtà JoinEUI).
            uint64_t joinEUI = 0, devEUI = 0;
            for (int i = 7; i >= 0; i--) joinEUI = (joinEUI << 8) | rxBuffer[1 + i];
            for (int i = 7; i >= 0; i--) devEUI = (devEUI << 8) | rxBuffer[9 + i];
            uint16_t devNonce = rxBuffer[17] | (rxBuffer[18] << 8);

            Serial.println("[RX] 🔑 JOIN REQUEST");
            Serial.printf("[RX]   JoinEUI:  %016llX\n", joinEUI);
            Serial.printf("[RX]   DevEUI:   %016llX\n", devEUI);
            Serial.printf("[RX]   DevNonce: %u\n", devNonce);
        } else {
            Serial.printf("[RX] DevAddr: 0x%08X\n", lorawanHeader.devAddr);
            Serial.printf("[RX] FCtrl: 0x%02X\n", lorawanHeader.fctrl);
            Serial.printf("[RX] FCnt: 0x%04X\n", lorawanHeader.fcnt);
            Serial.printf("[RX] FOptsLen: %d\n", lorawanHeader.getFOptsLen());
            Serial.printf("[RX] ACK: %s\n", lorawanHeader.getACK() ? "SI" : "NO");
            Serial.printf("[RX] FPending: %s\n", lorawanHeader.getFPending() ? "SI" : "NO");
        }

        // Forward to ChirpStack
        if (WiFi.isConnected()) {
            // Create JSON packet
            StaticJsonDocument<512> doc;
            JsonArray rxpk_array = doc.createNestedArray("rxpk");
            JsonObject rxpk = rxpk_array.createNestedObject();
            
            // Get current time
            struct timeval tv;
            gettimeofday(&tv, NULL);
            uint32_t tmst = (uint32_t)(tv.tv_sec * 1000000 + tv.tv_usec);
            
            rxpk["tmst"] = tmst;
            rxpk["freq"] = LORA_FREQUENCY;
            rxpk["chan"] = 0;
            rxpk["rfch"] = 0;
            rxpk["stat"] = 1;
            rxpk["modu"] = "LORA";
            
            char datr[16];
            snprintf(datr, sizeof(datr), "SF%dBW%.0f", LORA_SPREADING_FACTOR, LORA_BANDWIDTH);
            rxpk["datr"] = datr;
            
            char codr[8];
            snprintf(codr, sizeof(codr), "4/%d", LORA_CODING_RATE);
            rxpk["codr"] = codr;
            
            rxpk["rssi"] = (int)rssi;
            rxpk["lsnr"] = snr;
            rxpk["size"] = packetLength;
            rxpk["data"] = encodeBase64(rxBuffer, packetLength);
            
            String jsonString;
            serializeJson(doc, jsonString);
            
            Serial.println("[GW] Forwarding LORA PACKET to ChirpStack:");
            Serial.println(jsonString);
            
            sendUdpPacket(jsonString.c_str());
            stats.rx_fw++;
            
            // IMPORTANTE: ChirpStack invia downlink SOLO come risposta a PULL_DATA!
            // Invia PULL_DATA subito dopo PUSH_DATA per richiedere downlink dalla coda
            sendPullData();
            
            // Aspetta attivamente il PULL_RESP (con timeout 500ms per dare tempo a ChirpStack)
            unsigned long waitStart = millis();
            unsigned long waitTime = 700;

            bool pullRespReceived = false;

            // isJoinRequest (dichiarata più sopra, dopo la decodifica di
            // lorawanHeader): per una Join Request la Join Accept che
            // arriverà in risposta è cifrata, quindi il suo "DevAddr" è solo
            // rumore letto da byte cifrati - non corrisponderà mai a quello
            // (altrettanto fasullo) letto dalla join-request. In quel caso
            // peschiamo il primo downlink in coda invece di cercare un match.
            Serial.printf("[GW] ⚡ Attesa PULL_RESP for addr: 0x%08X (join=%s) downlink to queue after uplink (%lu ms), max wait time: %lu ms\n",
                          lorawanHeader.devAddr, isJoinRequest ? "yes" : "no", millis() - waitStart, waitTime);
            while (millis() - waitStart < waitTime) {  // Max 500ms di attesa (aumentato da 200ms)
                handleUdpDownlink(); // Controlla continuamente se arriva
                                   // PULL_RESP

                pullRespPacket = isJoinRequest
                                     ? dowQueue.findFirstPending()
                                     : dowQueue.findFirstByDevAddr(lorawanHeader.devAddr);
                if (pullRespPacket) {
                    pullRespReceived = true;
                    Serial.printf("[GW] ⚡ PULL_RESP ricevuto dopo uplink (%lu ms)\n", millis() - waitStart);
                    Serial.printf("[GW] %d messaggio/i in coda, sarà/anno trasmesso/i nelle finestre RX1/RX2\n", dowQueue.size());
                    break;
                }
            //   if (dowQueue.findFirstByDevAddr(uint32_t devAddr)) {
                
            //   }
                
                // Se abbiamo ricevuto un nuovo downlink, esci dal loop
                // if (downlinkQueueCount > 0 || pendingDownlink.pending) {
                //     pullRespReceived = true;
                //     Serial.printf("[PULL] ⚡ PULL_RESP ricevuto dopo uplink (%lu ms)\n", millis() - waitStart);
                //     Serial.printf("[PULL] %d messaggio/i in coda, sarà/anno trasmesso/i nelle finestre RX1/RX2\n", downlinkQueueCount);
                //     break;
                // }
                
                delay(5);  // Piccolo delay per non saturare la CPU
            }
            
            if (!pullRespReceived) {
                Serial.println("[PULL] Nessun PULL_RESP entro 500ms (normale se coda vuota)");
                Serial.println("[PULL] Nota: I downlink dalla coda possono arrivare anche dopo PULL_DATA periodici");
            }
            
        } else {
            Serial.println("[UDP] ERROR: WiFi disconnected, packet not forwarded");
        }

        
        Serial.println("[RX] =============================\n");
        digitalWrite(LED_PIN, HIGH);  // LED off
        
        // Invia risposta "OK" al nodo se abilitato
        // Per una Join Request lorawanHeader.devAddr è sempre 0 (non è un
        // campo valido per quel tipo di frame, vedi findFirstPending() sopra)
        // quindi lì il controllo va bypassato; per un downlink dati normale
        // resta un controllo di sanità valido.
        #if AUTO_DOWNLINK_ENABLED
        bool devAddrOk = isJoinRequest || (lorawanHeader.devAddr != 0);
        if (devAddrOk && pullRespPacket) {
          sendDownlinkResponse(rxTimestamp, pullRespPacket);
        } else {
            Serial.println("[DOWNLINK] DevAddr non valido o PULL_RESP non trovato, skip downlink");
        }
        #endif
        radio.startReceive();
        
