pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    } else if (state == RADIOLIB_ERR_RX_TIMEOUT) {
        // Timeout - nessun pacchetto ricevuto
        timeouts++;
        Serial.printf("[DEBUG] Timeout (totale: %lu) - Nessun pacchetto\n", timeouts);
        radio.startReceive();
    } else if (state == RADIOLIB_ERR_CRC_MISMATCH) {
        // CRC ERROR - MA I DATI SONO ARRIVATI!
        // Per LoRaWAN, accettiamo comunque (ha il suo MIC per verificare)
        crcErrors++;
        Serial.printf("[DEBUG] CRC ERROR (totale: %lu)\n", crcErrors);
        radio.startReceive();
    } else {
        // Altri errori
        otherErrors++;
        Serial.printf("\n[RX] ===== ERROR %d =====\n", state);
        Serial.printf("[RX] Totale altri errori: %lu\n", otherErrors);
        Serial.println("[RX] ======================\n");
        radio.startReceive();
    }
}

// ===========================
// UDP FUNCTIONS
// ===========================
void sendUdpPacket(const char* jsonData) {
    if (!WiFi.isConnected()) {
        Serial.println("[UDP] ERROR: WiFi not connected");
        return;
    }
    if (!hasServerIP()) {
        Serial.println("[UDP] ERROR: server not resolved yet");
        return;
    }

    udpClient.beginPacket(serverIP, SERVER_PORT);
    
    // Protocol version (always 0x02)
    udpClient.write((uint8_t)0x02);
    
    // Random token
    uint16_t token = random(0xFFFF);
    udpClient.write((uint8_t)(token >> 8));
    udpClient.write((uint8_t)(token & 0xFF));
    
    // Identifier: PUSH_DATA = 0x00
    udpClient.write((uint8_t)0x00);

    // Gateway ID (8 bytes)
    for (int i = 7; i >= 0; i--) {
        udpClient.write((uint8_t)((gatewayId >> (i * 8)) & 0xFF));
    }
    
    // JSON data
    udpClient.print(jsonData);
    
    int result = udpClient.endPacket();
    
    if (result) {
        Serial.println("[SEND UDP PACKET] Packet sent successfully");
    } else {
        Serial.println("[SEND UDP PACKET] ERROR: Failed to send packet");
    }
}

void sendStatPacket() {
    if (!WiFi.isConnected()) return;

    StaticJsonDocument<256> doc;
    
    JsonObject stat = doc.createNestedObject("stat");
    
    // Get current time
    time_t now = time(nullptr);
    struct tm timeinfo;
    gmtime_r(&now, &timeinfo);
    char timestamp[32];
    strftime(timestamp, sizeof(timestamp), "%Y-%m-%d %H:%M:%S GMT", &timeinfo);
    
    stat["time"] = timestamp;
    stat["rxnb"] = stats.rx_received;
    stat["rxok"] = stats.rx_ok;
    stat["rxfw"] = stats.rx_fw;
    stat["ackr"] = 100.0;
    stat["dwnb"] = stats.tx_received;
    stat["txnb"] = stats.tx_emitted;
    
    String jsonString;
    serializeJson(doc, jsonString);
    
    Serial.println("[STAT] Sending statistics:");
    Serial.println(jsonString);
    
    sendUdpPacket(jsonString.c_str());
}

// ===========================
// PULL_DATA - Chiede downlink a ChirpStack
// ===========================
void sendPullData() {
//   Serial.println("---- SEND PULL_DATA ----");
  unsigned long startMillis = millis();
    if (!WiFi.isConnected()) return;
    
    udpClient.beginPacket(serverIP, SERVER_PORT);
    
    // Protocol version (always 0x02)
    udpClient.write((uint8_t)0x02);
    
    // Random token
    uint16_t token = random(0xFFFF);
    udpClient.write((uint8_t)(token >> 8));
    udpClient.write((uint8_t)(token & 0xFF));
    
    // Identifier: PULL_DATA = 0x02
    udpClient.write((uint8_t)0x02);
    
    // Gateway ID (8 bytes)
    for (int i = 7; i >= 0; i--) {
        udpClient.write((uint8_t)((gatewayId >> (i * 8)) & 0xFF));
    }
    
    udpClient.endPacket();
    unsigned long endMillis = millis();
    Serial.printf("[PULL] Sent PULL_DATA to ChirpStack in: %lu ms\n", endMillis - startMillis);
}

// ===========================
// Gestisce pacchetti UDP da ChirpStack
// ===========================
void handleUdpDownlink() {
    int packetSize = udpClient.parsePacket();
    if (packetSize == 0) return;  // Nessun pacchetto
    
    Serial.printf("[handleUdpDownlink] Received packet size: %d\n", packetSize);
    
    uint8_t udpBuffer[512];
    int len = udpClient.read(udpBuffer, sizeof(udpBuffer));

    if (len < 4)
      return; // Pacchetto troppo corto
    if (len > sizeof(udpBuffer)) {
      Serial.println("[handleUdpDownlink] ❌ Pacchetto troppo grande");
      return;
    }

    SemtechUdpPackage packet;
    if (!packet.initFromBuffer(udpBuffer, len)) {
        Serial.println("[handleUdpDownlink] ❌ Errore parsing SemtechUdpPackage");
        return;
    }

    if (packet.getMessageType() == SemtechMessageType::PULL_ACK) {
      lastPullAck = millis();
    //   Serial.println("[handleUdpDownlink] PULL_ACK ricevuto - server CS raggiungibile");
      return;
    }else if (packet.getMessageType() == SemtechMessageType::PUSH_ACK) {
      // Conferma che il PUSH_DATA (stat o uplink) e' arrivato al server.
      // Per specifica e' lungo 4 byte e non ha payload: non c'e' nulla da fare.
      return;
    }else  if (packet.getMessageType() == SemtechMessageType::PULL_RESP) {
      PullResponseData responseData;
      if (packet.getPullResponse(responseData)) {
        Serial.println("[handleUdpDownlink] ✅ PULL_RESP ricevuto - downlink disponibile!");
        responseData.printDebug();

        PullRespPacket pullRespPacket;
        pullRespPacket.token = packet.getToken();
        pullRespPacket.responseData = responseData;
        if (dowQueue.add(pullRespPacket)) {
            Serial.println("[handleUdpDownlink] ✅ PULL_RESP aggiunto alla coda");
        } else {
            dowQueue.printDebug();
            Serial.println("[handleUdpDownlink] ❌ PULL_RESP scartato: coda piena");
        }
      }else{
        Serial.println("[handleUdpDownlink] ❌ PULL_RESP scartato: errore parsing PullResponseData");
        return;
      }
    } else {
        Serial.printf("[handleUdpDownlink] ? not implemented getMessageType: 0x%02X\n", static_cast<uint8_t>(packet.getMessageType()));
        Serial.println("[handleUdpDownlink] getMessageTypeString: " + String(packet.getMessageTypeString()));
        packet.printDebug();
    }
}



