pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
unsigned long getElapsedTime(unsigned long referenceMillis) {
  return millis() - referenceMillis;
}
// ===========================
// TRASMISSIONE DOWNLINK
// Ritorna true se la trasmissione è riuscita, false altrimenti
// ===========================
bool transmitDownlink(uint8_t* data, size_t length, unsigned long rxTimestamp,
                      const char** txError) {
    if (txError) *txError = nullptr;

    if (!radioInitialized) {
        Serial.println("[TX_DL] Radio non inizializzata");
        if (txError) *txError = "INTERNAL_ERROR";
        radio.startReceive();
        return false;
    }

    Serial.println("\n[TX_DL] ===== TRASMISSIONE DOWNLINK =====");
    Serial.printf("[TX_DL] Lunghezza: %d bytes\n", length);
    Serial.print("[TX_DL] Frame (HEX): ");
    for (size_t i = 0; i < length; i++) {
        Serial.printf("%02X ", data[i]);
    }
    Serial.println();

    // MHDR (primo byte, bit 7-5) dice se questo downlink è una Join Accept:
    // in quel caso le finestre RX1/RX2 seguono il timing (più lungo) della
    // join-accept, non quello dei downlink dati - vedi JOIN_ACCEPT_DELAY1/2.
    uint8_t mtype = length > 0 ? (data[0] >> 5) & 0x07 : 0xFF;
    bool isJoinAccept = (mtype == 0x01);
    unsigned long rx1Delay = isJoinAccept ? JOIN_ACCEPT_DELAY1 : RX1_DELAY;
    unsigned long rx2Delay = isJoinAccept ? JOIN_ACCEPT_DELAY2 : RX2_DELAY;
    Serial.printf("[TX_DL] Tipo: %s (rx1=%lums, rx2=%lums)\n",
                  isJoinAccept ? "Join Accept" : "Data downlink", rx1Delay, rx2Delay);

    // Calcola tempo trascorso dalla ricezione
    unsigned long elapsed = getElapsedTime(rxTimestamp);
    Serial.printf("[TX_DL] Tempo trascorso dalla RX: %lu ms\n", elapsed);

    bool transmitted = false;
    int rxWindow = 0;

    // ===== TENTATIVO RX1 =====
    if (elapsed < rx1Delay) {
        unsigned long waitTime = rx1Delay - elapsed;
        Serial.printf("[TX_DL] Attendo %lu ms per finestra RX1...\n", waitTime);
        delay(waitTime);
        
        unsigned long txStart = millis();
        unsigned long actualDelay = txStart - rxTimestamp;
        Serial.printf("[TX_DL] >>> FINESTRA RX1 (delay reale: %lu ms) <<<\n", actualDelay);
        
        digitalWrite(LED_PIN, LOW);
        
        // LoRaWAN usa IQ invertito per downlink!
        radio.invertIQ(true);
        
        int state = radio.transmit(data, length);
        
        // Ripristina IQ normale
        radio.invertIQ(false);
        
        unsigned long txEnd = millis();
        unsigned long txDuration = txEnd - txStart;
        
        if (state == RADIOLIB_ERR_NONE) {
            Serial.printf("[TX_DL] ✅ Trasmesso in RX1! (TX: %lu ms)\n", txDuration);
            stats.tx_emitted++;
            justTransmitted = true;
            transmitted = true;
            rxWindow = 1;
        } else {
            Serial.printf("[TX_DL] ❌ Errore RX1: %d\n", state);
            if (txError) *txError = "INTERNAL_ERROR";
        }

        digitalWrite(LED_PIN, HIGH);
    } else {
        Serial.printf("[TX_DL] ⚠️ RX1 persa (elapsed: %lu ms)\n", elapsed);
        if (txError) *txError = "TOO_LATE";
    }
    
    // ===== TENTATIVO RX2 (solo per debug, normalmente skip se RX1 OK) =====
    if (!transmitted) {
        elapsed = getElapsedTime(rxTimestamp);

        if (elapsed < rx2Delay) {
            unsigned long waitTime = rx2Delay - elapsed;
            Serial.printf("[TX_DL] Attendo %lu ms per finestra RX2...\n", waitTime);
            delay(waitTime);
            
            unsigned long txStart = millis();
            unsigned long actualDelay = txStart - rxTimestamp;
            Serial.printf("[TX_DL] >>> FINESTRA RX2 (delay reale: %lu ms) <<<\n", actualDelay);
            
            digitalWrite(LED_PIN, LOW);
            
            radio.invertIQ(true);
            int state = radio.transmit(data, length);
            radio.invertIQ(false);
            
            unsigned long txEnd = millis();
            unsigned long txDuration = txEnd - txStart;
            
            if (state == RADIOLIB_ERR_NONE) {
                Serial.printf("[TX_DL] ✅ Trasmesso in RX2! (TX: %lu ms)\n", txDuration);
                stats.tx_emitted++;
                justTransmitted = true;
                transmitted = true;
                rxWindow = 2;
            } else {
                Serial.printf("[TX_DL] ❌ Errore RX2: %d\n", state);
                if (txError) *txError = "INTERNAL_ERROR";
            }

            digitalWrite(LED_PIN, HIGH);
        } else {
            Serial.printf("[TX_DL] ❌ RX2 persa (elapsed: %lu ms)\n", elapsed);
            if (txError) *txError = "TOO_LATE";
        }
    }
    
    // ===== RIEPILOGO =====
    if (transmitted) {
        // RX1 puo' aver gia' scritto "TOO_LATE" prima che RX2 riuscisse
        if (txError) *txError = nullptr;
        Serial.printf("[TX_DL] ✅ Successo! Finestra: RX%d\n", rxWindow);
    } else {
        Serial.println("[TX_DL] ❌ FALLITO: Nessuna finestra disponibile");
    }
    
    Serial.println("[TX_DL] ==============================\n");
    
    // Riavvia la ricezione
    int state = radio.startReceive();
    if (state == RADIOLIB_ERR_NONE) {
        Serial.println("[LORA] Radio tornata in ascolto");
    } else {
        Serial.printf("[LORA] ❌ Errore riavvio ricezione: %d\n", state);
        radioInitialized = false;
    }
    
    // Ritorna true se la trasmissione è riuscita
    return transmitted;
}

// ===========================
// DECODIFICA PACCHETTO LORAWAN
// ===========================
void decodeLoRaWANPacket(uint8_t* data, size_t length) {
    if (length < 12) {
        Serial.println("[DECODE] ⚠️ Pacchetto troppo corto per essere LoRaWAN valido (min 12 bytes)");
        return;
    }
    
    Serial.println("\n[DECODE] ===== DECODIFICA PACCHETTO LORAWAN =====");
    
    // MHDR (1 byte)
    uint8_t mhdr = data[0];
    uint8_t mtype = (mhdr >> 5) & 0x07;  // Bits 7-5
    uint8_t major = mhdr & 0x03;  // Bits 1-0
    
    const char* mtypeNames[] = {
        "Join Request", "Join Accept", "Unconfirmed Data Up", 
        "Unconfirmed Data Down", "Confirmed Data Up", "Confirmed Data Down",
        "RFU", "Proprietary"
    };
    
