pa0lin082/ESP32-Radiolib-1ch-Gateway/src/main.cpp
    Serial.printf("[DECODE] MHDR: 0x%02X\n", mhdr);
    Serial.printf("[DECODE] MType: %d (%s)\n", mtype, mtype < 8 ? mtypeNames[mtype] : "Unknown");
    Serial.printf("[DECODE] Major: %d (LoRaWAN R%d)\n", major, major + 1);
    
    // DevAddr (4 bytes, little-endian)
    uint32_t devAddr = ((uint32_t)data[1]) | 
                       ((uint32_t)data[2] << 8) | 
                       ((uint32_t)data[3] << 16) | 
                       ((uint32_t)data[4] << 24);
    
    Serial.printf("[DECODE] DevAddr: 0x%08X\n", devAddr);
    Serial.printf("[DECODE] DevAddr (little-endian bytes): %02X %02X %02X %02X\n", 
                  data[1], data[2], data[3], data[4]);
    
    // FCtrl (1 byte)
    uint8_t fctrl = data[5];
    bool adr = (fctrl & 0x80) != 0;
    bool adrAckReq = (fctrl & 0x40) != 0;
    bool ack = (fctrl & 0x20) != 0;
    bool classB = (fctrl & 0x10) != 0;
    uint8_t foptsLen = fctrl & 0x0F;
    
    Serial.printf("[DECODE] FCtrl: 0x%02X\n", fctrl);
    Serial.printf("[DECODE]   ADR: %s\n", adr ? "SI" : "NO");
    Serial.printf("[DECODE]   ADRACKReq: %s\n", adrAckReq ? "SI" : "NO");
    Serial.printf("[DECODE]   ACK: %s\n", ack ? "SI" : "NO");
    Serial.printf("[DECODE]   ClassB: %s\n", classB ? "SI" : "NO");
    Serial.printf("[DECODE]   FOptsLen: %d\n", foptsLen);
    
    // FCnt (2 bytes, little-endian)
    uint16_t fcnt = ((uint16_t)data[6]) | ((uint16_t)data[7] << 8);
    Serial.printf("[DECODE] FCnt: %d (0x%04X)\n", fcnt, fcnt);
    
    size_t pos = 8;
    
    // FOpts (se presente, lunghezza in FCtrl)
    if (foptsLen > 0) {
        if (pos + foptsLen <= length - 4) {  // -4 per MIC
            Serial.printf("[DECODE] FOpts (%d bytes): ", foptsLen);
            for (uint8_t i = 0; i < foptsLen; i++) {
                Serial.printf("%02X ", data[pos + i]);
            }
            Serial.println();
            pos += foptsLen;
        } else {
            Serial.println("[DECODE] ⚠️ FOptsLen maggiore dello spazio disponibile");
        }
    }
    
    // FPort (1 byte, presente solo se c'è payload)
    uint8_t fport = 0;
    bool hasFPort = false;
    if (pos < length - 4) {  // C'è spazio per FPort + payload + MIC
        fport = data[pos];
        hasFPort = true;
        pos++;
        
        Serial.printf("[DECODE] FPort: %d\n", fport);
        
        // FRMPayload (se presente)
        size_t payloadLen = length - pos - 4;  // -4 per MIC
        if (payloadLen > 0) {
            Serial.printf("[DECODE] FRMPayload (%d bytes): ", payloadLen);
            for (size_t i = 0; i < payloadLen && i < 32; i++) {  // Limita a 32 bytes per display
                Serial.printf("%02X ", data[pos + i]);
            }
            if (payloadLen > 32) {
                Serial.print("...");
            }
            Serial.println();
            
            // Prova a decodificare come ASCII se sembra testo
            Serial.print("[DECODE] FRMPayload (ASCII): ");
            for (size_t i = 0; i < payloadLen && i < 32; i++) {
                uint8_t b = data[pos + i];
                if (b >= 32 && b <= 126) {
                    Serial.printf("%c", b);
                } else {
                    Serial.print(".");
                }
            }
            if (payloadLen > 32) {
                Serial.print("...");
            }
            Serial.println();
        }
    }
    
    // MIC (4 bytes, ultimi 4 bytes)
    Serial.printf("[DECODE] MIC: %02X %02X %02X %02X\n", 
                  data[length-4], data[length-3], data[length-2], data[length-1]);
    
    Serial.println("[DECODE] ===========================================\n");
}

// ===========================
// TX_ACK - Conferma trasmissione downlink a ChirpStack
// ===========================
void sendTxAck(uint16_t token, const char* error) {
    if (!WiFi.isConnected()) {
        Serial.println("[TX_ACK] WiFi non connesso, skip TX_ACK");
        return;
    }

    Serial.printf("[TX_ACK] Invio TX_ACK con token 0x%04X (error: %s)\n",
                  token, error ? error : "nessuno");
    
    udpClient.beginPacket(serverIP, SERVER_PORT);
    
    // Protocol version (always 0x02)
    udpClient.write((uint8_t)0x02);
    
    // Token (stesso del PULL_RESP)
    udpClient.write((uint8_t)(token >> 8));
    udpClient.write((uint8_t)(token & 0xFF));
    
    // Identifier: TX_ACK = 0x05
    udpClient.write((uint8_t)0x05);
    
    // Gateway ID (8 bytes)
    for (int i = 7; i >= 0; i--) {
        udpClient.write((uint8_t)((gatewayId >> (i * 8)) & 0xFF));
    }

    // JSON txpk_ack: opzionale, assente = nessun errore (PROTOCOL.TXT sez. 6).
    // Il gateway-bridge lo parsa solo se il pacchetto supera i 13 byte.
    if (error != nullptr) {
        char json[64];
        int n = snprintf(json, sizeof(json), "{\"txpk_ack\":{\"error\":\"%s\"}}", error);
        if (n > 0 && n < (int)sizeof(json)) {
            udpClient.write((const uint8_t*)json, n);
        }
    }

    int result = udpClient.endPacket();

    if (result) {
        Serial.println("[TX_ACK] ✅ TX_ACK inviato con successo");
    } else {
        Serial.println("[TX_ACK] ❌ Errore invio TX_ACK");
    }
}

// ===========================
// DOWNLINK RESPONSE
// ===========================
void sendDownlinkResponse(unsigned long rxTimestamp, PullRespPacket *pullRespPacket) {
    if (!radioInitialized) {
        Serial.println("[DOWNLINK] Radio non inizializzata");
        radio.startReceive();
        return;
    }
    
    if (pullRespPacket) {
        // Serial.printf("[DOWNLINK] ✅ %d messaggio/i in coda per DevAddr 0x%08X!\n", messagesForDevAddr, devAddr);
        
        // Trasmetti il primo messaggio in RX1
        // PendingDownlink* dl1 = &downlinkQueue[indices[0]];
        Serial.println("[DOWNLINK] 📤 Trasmissione messaggio 1 in RX1...");
        const char* txError = nullptr;
        bool tx1Success = transmitDownlink(
            pullRespPacket->responseData.decodedPayload,  // Dati binari decodificati (non base64!)
            pullRespPacket->responseData.decodedLength,    // Lunghezza corretta
            rxTimestamp,
            &txError
        );

        if (tx1Success) {
            Serial.println("[DOWNLINK] ✅ Messaggio 1 trasmesso con successo, invio TX_ACK");
            sendTxAck(pullRespPacket->token);

            dowQueue.remove(pullRespPacket);

        } else {
            // Il TX_ACK di errore va mandato comunque: senza, ChirpStack non sa
            // che il downlink e' andato perso e non prova l'opzione successiva.
            const char* err = txError ? txError : "INTERNAL_ERROR";
            Serial.printf("[DOWNLINK] ❌ Trasmissione messaggio 1 fallita (%s), invio TX_ACK di errore\n", err);
            sendTxAck(pullRespPacket->token, err);

            // Rimuovere sempre: ritentare e' compito di ChirpStack, non del
            // gateway. Lasciandolo in coda si satura MAX_DOWNLINK_PER_DEVADDR
            // e ogni downlink futuro di questo device verrebbe rifiutato.
            dowQueue.remove(pullRespPacket);
        }
        
        // Reset compatibilità
        // pendingDownlink.pending = false;
        return;
    }
    
}


